Reports/CRM_ПоказателиМенеджеровПоПериодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>CRM_ПоказателиМенеджеровПоПериодам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокДоступныхТиповГруппировки</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаДиаграммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасшифровка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДиаграммы</Name>
					<Type>
						<v8:Type>v8ui:ChartType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДиаграмму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДиаграмма</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеПоляОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРесурсыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиДиаграммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/CRM_ПоказателиМенеджеровПоПериодам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьПериод(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();

	Диалог.Период.ДатаНачала    = Отчет.Период.ДатаНачала;
	Диалог.Период.ДатаОкончания = Отчет.Период.ДатаОкончания ;

	Если Диалог.Редактировать() Тогда
		Отчет.Период.ДатаНачала    = Диалог.Период.ДатаНачала;
		Отчет.Период.ДатаОкончания = Диалог.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляГруппировки(СтруктураГруппировок)
	Если СтруктураГруппировок.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из СтруктураГруппировок Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Для Каждого ЭлементПоляГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				НоваяСтрока = Отчет.Группировки.Добавить();
				НоваяСТрока.Поле = СокрЛП(ЭлементПоляГруппировки.Поле);
				Если ЭлементПоляГруппировки.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Иерархия Тогда
					НоваяСтрока.ТипГруппировки = "Иерархия";
				ИначеЕсли ЭлементПоляГруппировки.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
					НоваяСтрока.ТипГруппировки = "ТолькоИерархия";
				Иначе
					НоваяСтрока.ТипГруппировки = "Элементы";
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого полеВыбора Из ЭлементСтруктуры.Выбор.Элементы Цикл
				Если ТипЗнч(полеВыбора)=Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				врОтбор = Новый Структура;
				врОтбор.Вставить("ИмяПоля", СокрЛП(полеВыбора.Поле)); 
				нСтроки = Отчет.ДоступныеПоляОтчета.НайтиСтроки(врОтбор);
				Для Каждого текСтрока Из нСтроки Цикл
					текСтрока.Пометка = Истина;
					
					// переместим текущую строку в начало таблицы
					врИндексПредыдущейСтроки = текСТрока.НомерСтроки-2;
					врИндексСтроки = текСТрока.НомерСтроки-1;
					Пока врИндексПредыдущейСтроки>=0 И Отчет.ДоступныеПоляОтчета[врИндексПредыдущейСтроки].Пометка=Ложь Цикл
						Отчет.ДоступныеПоляОтчета.Сдвинуть(врИндексСтроки, -1);
						
						врИндексПредыдущейСтроки = врИндексПредыдущейСтроки-1;
						врИндексСтроки = врИндексСтроки-1;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			Если ЭлементСтруктуры.Структура.Количество()>0 Тогда
				ЗаполнитьПоляГруппировки(ЭлементСтруктуры.Структура);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			Для Каждого выбТочка Из ЭлементСтруктуры.Точки Цикл
				Для Каждого полеВыбора Из выбТочка.ПоляГруппировки.Элементы Цикл
					врОтбор = Новый Структура;
					врОтбор.Вставить("ИмяПоля", СокрЛП(полеВыбора.Поле)); 
					нСтроки = Отчет.ДоступныеПоляОтчета.НайтиСтроки(врОтбор);
					Для Каждого текСтрока Из нСтроки Цикл
						Если текСтрока.Ресурс=Ложь Тогда
							Отчет.ГруппировкаДиаграммы = полеВыбора.Поле;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляРесурсов(Настройки)
	Для Каждого ПолеРесурса Из Настройки.Выбор.Элементы Цикл
		Если ТипЗнч(ПолеРесурса)=Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		врОтбор = Новый Структура;
		врОтбор.Вставить("ИмяПоля", СокрЛП(ПолеРесурса.Поле)); 
		нСтроки = Отчет.ДоступныеРесурсыОтчета.НайтиСтроки(врОтбор);
		Для Каждого текСтрока Из нСтроки Цикл
			текСтрока.Пометка = Истина;
			
			// переместим текущую строку в начало таблицы
			врИндексПредыдущейСтроки = текСТрока.НомерСтроки-2;
			врИндексСтроки = текСТрока.НомерСтроки-1;
			Пока врИндексПредыдущейСтроки>=0 И Отчет.ДоступныеРесурсыОтчета[врИндексПредыдущейСтроки].Пометка=Ложь Цикл
				Отчет.ДоступныеРесурсыОтчета.Сдвинуть(врИндексСтроки, -1);
				
				врИндексПредыдущейСтроки = врИндексПредыдущейСтроки-1;
				врИндексСтроки = врИндексСтроки-1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора(НастройкиОтчета)
	
	// список типов группировки
	Отчет.СписокДоступныхТиповГруппировки.Очистить();
	Отчет.СписокДоступныхТиповГруппировки.Добавить("Элементы");
	Отчет.СписокДоступныхТиповГруппировки.Добавить("Иерархия");
	Отчет.СписокДоступныхТиповГруппировки.Добавить("ТолькоИерархия");
	
	// список доступных полей
	Отчет.ДоступныеПоляОтчета.Очистить();
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
	
	// поля
	Для Каждого Набор Из ОсновнаяСхемаКомпоновкиДанных.НаборыДанных Цикл
		Для Каждого выбПоле Из Набор.Поля Цикл
			Если выбПоле.ПутьКДанным = "Менеджер" ИЛИ выбПоле.ПутьКДанным = "ТипТрафика"
			ИЛИ выбПоле.ПутьКДанным = "Отдел" ИЛИ выбПоле.ПутьКДанным = "ДилерскийЦентр"
			ИЛИ выбПоле.ПутьКДанным = "ПервичныйПовторный" ИЛИ выбПоле.ПутьКДанным = "Обработан" Тогда
				нСтрока = Отчет.ДоступныеПоляОтчета.Добавить();
				нСтрока.Пометка = Истина;
				нСтрока.ИмяПоля = выбПоле.ПутьКДанным;
				нСтрока.Ресурс = Ложь;
				нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
				нСтрока.Предопределенное = Истина;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	// вычисляемые поля
	Для Каждого вычисляемоеПоле Из ОсновнаяСхемаКомпоновкиДанных.ВычисляемыеПоля Цикл
		нСтрока = Отчет.ДоступныеРесурсыОтчета.Добавить();
		нСтрока.Пометка = Ложь;
		нСтрока.ИмяПоля = вычисляемоеПоле.ПутьКДанным;
		нСтрока.Ресурс = Ложь;
		нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
		нСтрока.Предопределенное = Истина;
	КонецЦикла;
	
	// ресурсы
	Для Каждого полеИтога Из ОсновнаяСхемаКомпоновкиДанных.ПоляИтога Цикл
		врОтбор = Новый СТруктура;
		врОтбор.Вставить("ИмяПоля",полеИтога.ПутьКДанным);
		МассивСтрок = Отчет.ДоступныеРесурсыОтчета.НайтиСтроки(врОтбор);
		//Для Каждого текСтрока Из МассивСтрок Цикл
		//	текСтрока.Ресурс = Истина;
		//КонецЦикла;
		Если МассивСтрок.Количество() = 0 Тогда
			ПолеНабора = ОсновнаяСхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти(полеИтога.ПутьКДанным);
			
			нСтрока = Отчет.ДоступныеРесурсыОтчета.Добавить();
			нСтрока.Пометка = Истина;
			нСтрока.ИмяПоля = полеИтога.ПутьКДанным;
			нСтрока.Представление = ПолеНабора.Заголовок;
			нСтрока.Ресурс = Истина;
			нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
			нСтрока.Предопределенное = Истина;
			
			
			Показатель = Отчет.ПоказателиДиаграммы.Добавить();
			Показатель.Пометка = Истина;
			Показатель.ИмяПоля = полеИтога.ПутьКДанным;
			Показатель.Представление = ПолеНабора.Заголовок;
		КонецЕсли;
		//НЕ (выбПоле.ПутьКДанным = "Отдел" ИЛИ выбПоле.ПутьКДанным = "ТипТрафика" ИЛИ выбПоле.ПутьКДанным = "ПервичныйПовторный")
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	Отчет.ТипДиаграммы = ТипДиаграммы.КруговаяОбъемная;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"CRM_ПоказателиМенеджеровПоПериодам") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	// установим списки выбора для полей настроек отчета
	СписокДоступныхПолейДиаграммы = Новый СписокЗначений;
	СписокДоступныхПолейГруппировки = Новый СписокЗначений;
	Для Каждого текСтрока Из Отчет.ДоступныеПоляОтчета Цикл
		Если текСТрока.Ресурс Тогда
			СписокДоступныхПолейДиаграммы.Добавить(текСтрока.ИмяПоля);
		Иначе
			СписокДоступныхПолейГруппировки.Добавить(текСтрока.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	Для Каждого текСтрока Из Отчет.ДоступныеРесурсыОтчета Цикл
		Если текСТрока.Ресурс Тогда
			СписокДоступныхПолейДиаграммы.Добавить(текСтрока.ИмяПоля);
		Иначе
			СписокДоступныхПолейГруппировки.Добавить(текСтрока.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	СписокДоступныхПолейГруппировки.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	ЭтаФорма.Элементы.Группировки1ТипГруппировки.СписокВыбора.ЗагрузитьЗначения(Отчет.СписокДоступныхТиповГруппировки.ВыгрузитьЗначения());
	ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПолейГруппировки.ВыгрузитьЗначения());
	
	ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПолейГруппировки.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Возврат; // пока без расшифровки
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Отчет.Группировки.Очистить();

	Если Настройки<>Неопределено Тогда
		ЗаполнитьСпискиВыбора(Настройки);
		ЗаполнитьПоляГруппировки(Настройки.Структура);
		ЗаполнитьПоляРесурсов(Настройки);
		
		Отчет.РезультатДиаграмма.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьНастройкиСервер(идФормы)
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
    ОтчетОбъект.СформироватьСхемуКомпоновкиДанных();
	
	Попытка
		АдресСКД = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, идФормы);
	Исключение
		АдресСКД = Неопределено;
	КонецПопытки;
	
	Возврат АдресСКД;
КонецФункции

&НаКлиенте
Процедура ОбновитьНастройки()
	АдресСКД = ОбновитьНастройкиСервер(этаФорма.УникальныйИдентификатор);
	
	Если АдресСКД=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	источникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	Отчет.КомпоновщикНастроек.Инициализировать(источникДоступныхНастроек);
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляОтчетаПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Предопределенное Тогда
		Отказ = Истина;
	Иначе
		// удалим поле из списков выбора
		имяПоля = Элемент.ТекущиеДанные.ИмяПоля;
		нЗначение = ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.НайтиПоЗначению(имяПоля);
		Если нЗначение<>Неопределено Тогда
			ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.Удалить(нЗначение);
		КонецЕсли;
		нЗначение = ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.НайтиПоЗначению(имяПоля);
		Если нЗначение<>Неопределено Тогда
			ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.Удалить(нЗначение);
		КонецЕсли;
		
		// удалим группировки
		нОтбор = Новый Структура;
		нОтбор.Вставить("Поле",имяПоля); 
		найденныеСтроки = Отчет.Группировки.НайтиСтроки(нОтбор);
		Для Каждого текСтрока Из найденныеСтроки Цикл
			Отчет.Группировки.Удалить(текСтрока);
		КонецЦикла;	
		
		// группировка диаграммы
		Если Отчет.ГруппировкаДиаграммы=имяПоля Тогда
			// заменим на первую группировку из списка группировок строк
			Если Отчет.Группировки.Количество()>0 Тогда
				Отчет.ГруппировкаДиаграммы = Отчет.Группировки[0].Поле;
			Иначе
				Отчет.ГруппировкаДиаграммы = "";
			КонецЕсли;
		КонецЕсли;
		
		// удалим поля из отбора
		массивДляУдаления = Новый Массив;
		Для Каждого текЭлемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если СокрЛП(текЭлемент.ЛевоеЗначение)=имяПоля ИЛИ СокрЛП(текЭлемент.ПравоеЗначение)=имяПоля Тогда
				массивДляУдаления.Добавить(текЭлемент);				
			КонецЕсли;
		КонецЦикла;
		Если массивДляУдаления.Количество()>0 тогда
			Для Каждого текЭлемент Из массивДляУдаления Цикл
				Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(текЭлемент);
			КонецЦикла;			
		КонецЕсли;
		
		// удалим значения упорядочивания
		массивДляУдаления = Новый Массив;
		Для Каждого текЭлемент Из Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы Цикл
			Если СокрЛП(текЭлемент.Поле)=имяПоля Тогда
				массивДляУдаления.Добавить(текЭлемент);				
			КонецЕсли;
		КонецЦикла;
		Если массивДляУдаления.Количество()>0 тогда
			Для Каждого текЭлемент Из массивДляУдаления Цикл
				Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы.Удалить(текЭлемент);
			КонецЦикла;			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляОтчетаПослеУдаления(Элемент)
	ОбновитьНастройки();
КонецПроцедуры

&НаСервере
Функция ДобавитьДоступноеПолеСервер(выбЗначение)
	// вставим выбранное значение последним помеченным значением перед ресурсом
	// если значение уже существует, то переместим его и установим пометку
	
	идСтроки = "";
	
	врОтбор = Новый Структура;
	врОтбор.Вставить("ДополнительноеПоле", выбЗначение);
	нСтроки = Отчет.ДоступныеПоляОтчета.НайтиСтроки(врОтбор);
	Если нСтроки.Количество()=0 Тогда
		индексСтрокиДляВставки = Неопределено;
		
		Для Каждого текСтрока Из Отчет.ДоступныеПоляОтчета Цикл
			Если текСтрока.Пометка=Ложь ИЛИ (текСтрока.Пометка И текСтрока.Ресурс) Тогда
				индексСтрокиДляВставки = текСтрока.НомерСтроки-1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если индексСтрокиДляВставки=Неопределено Тогда
			// все строки помечены, добавляем в конец списка
			нСтрока = Отчет.ДоступныеПоляОтчета.Добавить();
		Иначе
			нСтрока = Отчет.ДоступныеПоляОтчета.Вставить(индексСтрокиДляВставки);
		КонецЕсли;
		
		нСтрока.Пометка = Истина;
		нСтрока.ИмяПоля = выбЗначение.Наименование;
		нСтрока.Ресурс = Ложь;
		нСтрока.ДополнительноеПоле = выбЗначение.Ссылка;
		нСтрока.Предопределенное = Ложь;
		
		идСтроки = нСтрока.ПолучитьИдентификатор();
	Иначе
		Для Каждого текСтрока Из нСтроки Цикл
			Если текСтрока.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			текСтрока.Пометка = Истина;
			
			// переместим текущую строку в начало таблицы
			врИндексПредыдущейСтроки = текСТрока.НомерСтроки-2;
			врИндексСтроки = текСТрока.НомерСтроки-1;
			Пока врИндексПредыдущейСтроки>=0 И (Отчет.ДоступныеПоляОтчета[врИндексПредыдущейСтроки].Пометка=Ложь ИЛИ Отчет.ДоступныеПоляОтчета[врИндексПредыдущейСтроки].Ресурс) Цикл
				Отчет.ДоступныеПоляОтчета.Сдвинуть(врИндексСтроки, -1);
				
				врИндексПредыдущейСтроки = врИндексПредыдущейСтроки-1;
				врИндексСтроки = врИндексСтроки-1;
			КонецЦикла;
		КонецЦикла;
		
		идСтроки = текСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
	Возврат идСтроки;
КонецФункции

&НаКлиенте
Процедура ДобавитьДоступноеПоле(Команда)
	
	выбЗначение = "";
	Если ВвестиЗначение(выбЗначение,"Выберите дополнительное поле",Тип("ПланВидовХарактеристикСсылка.CRM_РеквизитыТрафика")) Тогда
		Если выбЗначение=Неопределено ИЛИ выбЗначение.Пустая() ИЛИ выбЗначение.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
		
		ЭтаФорма.Элементы.ДоступныеПоляОтчета.ТекущаяСтрока = ДобавитьДоступноеПолеСервер(выбЗначение);
		
		// добавим это поле в списки выбора группировок
		Если ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.НайтиПоЗначению(выбЗначение.Наименование)=Неопределено Тогда
			ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.Добавить(выбЗначение.Наименование);
		КонецЕсли;
		Если ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.НайтиПоЗначению(выбЗначение.Наименование)=Неопределено Тогда
			ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.Добавить(выбЗначение.Наименование);
		КонецЕсли;
		
		// обновим настройки
	    ОбновитьНастройки();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РезультатДиаграммаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Возврат; // пока без расшифровки
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРезультатСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаРезультатСтраницы.ТекущаяСтраница.Имя = "СтраницаРезультат" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ДоступныеПоля;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДиаграммы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ДоступныеПоля" Тогда
		Элементы.ГруппаРезультатСтраницы.ТекущаяСтраница = Элементы.СтраницаРезультат;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаДиаграммы" Тогда
		Элементы.ГруппаРезультатСтраницы.ТекущаяСтраница = Элементы.СтраницаДиаграмма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеРесурсыОтчетаПослеУдаления(Элемент)
	ОбновитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеРесурсыОтчетаПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Предопределенное Тогда
		Отказ = Истина;
	Иначе
		// удалим поле из списков выбора
		имяПоля = Элемент.ТекущиеДанные.ИмяПоля;
		нЗначение = ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.НайтиПоЗначению(имяПоля);
		Если нЗначение<>Неопределено Тогда
			ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.Удалить(нЗначение);
		КонецЕсли;
		нЗначение = ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.НайтиПоЗначению(имяПоля);
		Если нЗначение<>Неопределено Тогда
			ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.Удалить(нЗначение);
		КонецЕсли;
		
		// удалим группировки
		нОтбор = Новый Структура;
		нОтбор.Вставить("Поле",имяПоля); 
		найденныеСтроки = Отчет.Группировки.НайтиСтроки(нОтбор);
		Для Каждого текСтрока Из найденныеСтроки Цикл
			Отчет.Группировки.Удалить(текСтрока);
		КонецЦикла;	
		
		// группировка диаграммы
		Если Отчет.ГруппировкаДиаграммы=имяПоля Тогда
			// заменим на первую группировку из списка группировок строк
			Если Отчет.Группировки.Количество()>0 Тогда
				Отчет.ГруппировкаДиаграммы = Отчет.Группировки[0].Поле;
			Иначе
				Отчет.ГруппировкаДиаграммы = "";
			КонецЕсли;
		КонецЕсли;
		
		// удалим поля из отбора
		массивДляУдаления = Новый Массив;
		Для Каждого текЭлемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если СокрЛП(текЭлемент.ЛевоеЗначение)=имяПоля ИЛИ СокрЛП(текЭлемент.ПравоеЗначение)=имяПоля Тогда
				массивДляУдаления.Добавить(текЭлемент);				
			КонецЕсли;
		КонецЦикла;
		Если массивДляУдаления.Количество()>0 тогда
			Для Каждого текЭлемент Из массивДляУдаления Цикл
				Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(текЭлемент);
			КонецЦикла;			
		КонецЕсли;
		
		// удалим значения упорядочивания
		массивДляУдаления = Новый Массив;
		Для Каждого текЭлемент Из Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы Цикл
			Если СокрЛП(текЭлемент.Поле)=имяПоля Тогда
				массивДляУдаления.Добавить(текЭлемент);				
			КонецЕсли;
		КонецЦикла;
		Если массивДляУдаления.Количество()>0 тогда
			Для Каждого текЭлемент Из массивДляУдаления Цикл
				Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы.Удалить(текЭлемент);
			КонецЦикла;			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = "Выбор файла";
		
	РезультатФайл = ВыборФайла.Выбрать();
	ПолноеИмяФайла = ВыборФайла.ПолноеИмяФайла;
	Если ПолноеИмяФайла = "" Тогда
	Иначе
		ПечатьНаСервере(ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ПолноеИмяФайла)
	
	Если Элементы.ГруппаРезультатСтраницы.ТекущаяСтраница = Элементы.СтраницаРезультат Тогда
		ТабличныйДокументЭкспорта = Результат;
	ИначеЕсли Элементы.ГруппаРезультатСтраницы.ТекущаяСтраница = Элементы.СтраницаДиаграмма Тогда
		ТабличныйДокументЭкспорта = Отчет.РезультатДиаграмма;
	КонецЕсли;
	
	ТабличныйДокументЭкспорта.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("ОШИБКА! Приложение MS Excel отсутствует или недостаточно прав доступа!
		|	- " + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(ПолноеИмяФайла);
	tmpBook = Excel.Workbooks.Item(Excel.Workbooks.Count); 
	//КнигаExcel = Excel.Workbooks.Add(); 
	//
	//ЛистТаблицы = КнигаExcel.WorkSheets.Item(1); 
	//ЛистТаблицы.Name = "Сводная таблица";
	//
	//КнигаExcel.Activate();
		
	Excel.Visible = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	Элементы.ГруппаСтраницы.Видимость = НЕ Элементы.КнопкаНастройки.Пометка;
	Элементы.КнопкаНастройки.Пометка = НЕ Элементы.КнопкаНастройки.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура Группировки1ПолеПриИзменении(Элемент)
	
	Если Элемент.Родитель.ТекущиеДанные.ТипГруппировки = "" Тогда
		Элемент.Родитель.ТекущиеДанные.ТипГруппировки = "Элементы";
	КонецЕсли;
	
КонецПроцедуры
